<!--test.vue-->
<template>
    <div class="qk-ve-scatter"><ve-scatter :data="chartData" width="100%" height="100%" :settings="chartSettings" ref="veChart"></ve-scatter></div>
</template>

<script>
export default {
    name: 'QkVeScatter', // 这个名字很重要，它就是未来的标签名<qk-text></qk-text>
    props: {
        chartData: {
            type: Object,
            default: () => {
                return {
                    columns: ['日期', '访问用户', '下单用户', '年龄'],
                    rows: {
                        上海: [
                            { 日期: '1/1', 访问用户: 123, 年龄: 3, 下单用户: 1244 },
                            { 日期: '1/2', 访问用户: 1223, 年龄: 6, 下单用户: 2344 },
                            { 日期: '1/3', 访问用户: 7123, 年龄: 9, 下单用户: 3245 },
                            { 日期: '1/4', 访问用户: 4123, 年龄: 12, 下单用户: 4355 },
                            { 日期: '1/5', 访问用户: 3123, 年龄: 15, 下单用户: 4564 },
                            { 日期: '1/6', 访问用户: 2323, 年龄: 20, 下单用户: 6537 }
                        ],
                        北京: [
                            { 日期: '1/1', 访问用户: 123, 年龄: 3, 下单用户: 1244 },
                            { 日期: '1/2', 访问用户: 1273, 年龄: 6, 下单用户: 2344 },
                            { 日期: '1/3', 访问用户: 3123, 年龄: 15, 下单用户: 4564 },
                            { 日期: '1/4', 访问用户: 2123, 年龄: 9, 下单用户: 3245 },
                            { 日期: '1/5', 访问用户: 4103, 年龄: 12, 下单用户: 4355 },
                            { 日期: '1/6', 访问用户: 7123, 年龄: 10, 下单用户: 3567 }
                        ],
                        广州: [
                            { 日期: '1/1', 访问用户: 123, 年龄: 3, 下单用户: 1244 },
                            { 日期: '1/2', 访问用户: 1223, 年龄: 6, 下单用户: 2344 },
                            { 日期: '1/3', 访问用户: 2123, 年龄: 30, 下单用户: 3245 },
                            { 日期: '1/5', 访问用户: 4123, 年龄: 12, 下单用户: 4355 },
                            { 日期: '1/4', 访问用户: 5123, 年龄: 18, 下单用户: 4564 },
                            { 日期: '1/6', 访问用户: 3843, 年龄: 30, 下单用户: 4850 }
                        ]
                    }
                };
            }
        },
        chartSettings: {
            type: Object,
            default: () => {
                return {
                    tooltipTrigger: 'axis'
                };
            }
        }
    },
    data() {
        return {
            timer: ''
        };
    },
    mounted() {},
    methods: {}
};
</script>

<style lang="less">
.qk-ve-scatter {
    width: 100%;
    height: 100%;
    // word-break: keep-all;
}
</style>
